In [1]:
import pandas as pd

In [17]:
a=pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [18]:
b=pd.Series([6,7,8,9])
b

0    6
1    7
2    8
3    9
dtype: int64

In [19]:
a

0    1
1    2
2    3
3    4
dtype: int64

In [20]:
pd.concat([a,b])

0    1
1    2
2    3
3    4
0    6
1    7
2    8
3    9
dtype: int64

In [21]:
ab=pd.DataFrame({'id':[1,2,3,4],'name':['a','b','c','d'],'class':[7,8,9,10]})
ab

   id name  class
0   1    a      7
1   2    b      8
2   3    c      9
3   4    d     10

In [22]:
ba=pd.DataFrame({'id':[6,7,8,89],'name':['f','g','h','i'],'class':[6,8,7,10]})
ba

   id name  class
0   6    f      6
1   7    g      8
2   8    h      7
3  89    i     10

In [24]:
pd.concat([ab,ba],axis=1)

   id name  class  id name  class
0   1    a      7   6    f      6
1   2    b      8   7    g      8
2   3    c      9   8    h      7
3   4    d     10  89    i     10

In [25]:
pd.concat([ab,ba],ignore_index=True)

   id name  class
0   1    a      7
1   2    b      8
2   3    c      9
3   4    d     10
4   6    f      6
5   7    g      8
6   8    h      7
7  89    i     10

In [27]:
ac=pd.DataFrame({'id':[3,4],'name':['c','d'],'class':[9,10]})
ac

   id name  class
0   3    c      9
1   4    d     10

In [28]:
pd.concat([ab,ac])

   id name  class
0   1    a      7
1   2    b      8
2   3    c      9
3   4    d     10
0   3    c      9
1   4    d     10

In [29]:
pd.concat([ab,ac],axis=1)

   id name  class   id name  class
0   1    a      7  3.0    c    9.0
1   2    b      8  4.0    d   10.0
2   3    c      9  NaN  NaN    NaN
3   4    d     10  NaN  NaN    NaN

In [30]:
pd.concat([ab,ac],axis=1,join='inner')

   id name  class  id name  class
0   1    a      7   3    c      9
1   2    b      8   4    d     10

In [35]:
pd.concat([ab,ba],keys=['ab','ba'])

      id name  class
ab 0   1    a      7
   1   2    b      8
   2   3    c      9
   3   4    d     10
ba 0   6    f      6
   1   7    g      8
   2   8    h      7
   3  89    i     10

   id name  class
0   1    a      7
1   2    b      8
2   3    c      9
3   4    d     10
0   3    c      9
1   4    d     10